[
	{
		"id": "https://direct.mit.edu/neco/article/doi/10.1162/neco_a_01736/127435",
		"type": "article-journal",
		"title": "Uncovering Dynamical Equations of Stochastic Decision Models Using Data-Driven SINDy Algorithm",
		"container-title": "Neural Computation",
		"page": "1-19",
		"volume": "1",
		"issue": "0",
		"source": "MIT Press",
		"abstract": "Decision formation in perceptual decision making involves sensory evidence accumulation instantiated by the temporal integration of an internal decision variable toward some decision criterion or threshold, as described by sequential sampling theoretical models. The decision variable can be represented in the form of experimentally observable neural activities. Hence, elucidating the appropriate theoretical model becomes crucial to understanding the mechanisms underlying perceptual decision formation. Existing computational methods are limited to either fitting of choice behavioral data or linear model estimation from neural activity data. In this work, we made use of sparse identification of nonlinear dynamics (SINDy), a data-driven approach, to elucidate the deterministic linear and nonlinear components of often-used stochastic decision models within reaction time task paradigms. Based on the simulated decision variable activities of the models and assuming the noise coefficient term is known beforehand, SINDy, enhanced with approaches using multiple trials, could readily estimate the deterministic terms in the dynamical equations, choice accuracy, and decision time of the models across a range of signal-to-noise ratio values. In particular, SINDy performed the best using the more memory-intensive multitrial approach while trial averaging of parameters performed more moderately. The single-trial approach, although expectedly not performing as well, may be useful for real-time modeling. Taken together, our work offers alternative approaches for SINDy to uncover the dynamics in perceptual decision making and, more generally, for first-passage time problems.",
		"DOI": "https://doi.org/10.1162/neco_a_01736",
		"author": [
			{
				"family": "Lenfesty",
				"given": "B."
			},
			{
				"family": "Bhattacharyya",
				"given": "S."
			},
			{
				"family": "Wong-Lin",
				"given": "KongFatt"
			}
		],
		"issued": {
			"date-parts": [
				[
					"2025",
					1
				]
			]
		}
	}
]
